{
  "transcript": "I chained this massive rock\nto a random guy! Hi! And when this chain runs out, it's going\nto pull him to the bottom of the ocean. And this is only the first\nof 7 death traps we have planned for him. Like balancing\nhundreds of feet in the air, stealing from\na thousand-pound grizzly bear, driving through a literal minefield, and so much more. And if he can survive all of that,\nI'll give him half a million dollars. God, here we go! But first things first,\nhe'll have to escape this trap which, like all of them,\nis so dangerous, we had to have\ntrained safety professionals on set. And every second it takes him\nto unlock his chain, he sinks deeper and deeper\ninto the ocean. Oh! He's up! He did it!! Yes! Congrats! Woo! You're now one step closer\nto half a million dollars! Yeah! But escaping this next trap\nwon't be so easy. Welcome to the second death trap! - Open the cage!\n- What? Take off your blindfold and turn around. Oh, my God! This real-life 1,000-pound grizzly bear\nis now guarding your money. I think that 50 grand is his now. And like every trap in this video,\nyour money has been split up. However many bags of 50 grand\nyou can get to the exit moves on with you to the next trap. The challenge begins now. Good luck. All right, I'm just gonna get froggy. Oh, he's getting so close to the bear. You went for that one of all of ‘em? How are you staying so calm? I'm not. I look this way,\nbut the reality is, I'm not calm. The bear just looked at you walk by. Uh, be careful, bro… Even though Byron was absolutely terrified - of getting torn to shreds by this bear…\n- Brother? The bear is literally standing\non one of the bags. He's gonna rip that open. The bear was fixated on one bag of money. He's preoccupied. Byron snuck around the room,\neasily collecting the rest, until the bag the bear was eating\nwas the last one. The last fifty grand\nis currently being eaten by the bear. Byron, you don't have to do this.\nYou can stop. Byron, if you're too afraid\nto steal that last bag from the bear… you can quit now\nand just move on to the next trap with the money you did get. No. I'm not quitting. Well, be careful.\nDon't grab it yet. Just maybe wait\ntill he gets bored of it. He's trying to distract the bear\naway from his money. Oh, it might— It's kinda working. He's trying to get a killing machine\nto go over to him. He might be the first human ever to want\na thousand-pound bear to come towards him. Oh my God,\nhe's going for the last bag! - Oh! He did it!\n- He got it! Oh my God! Oh my God! Congrats! And for our third of seven death traps,\nyou might recognize the challenge, but we put a new spin on it\njust for Byron. Take off your blindfold!\nWelcome to the next death trap. Oh, no, Jimmy… We're not even 100 feet in the air yet. Oh my God! Raise us up! Welcome to the Balance Beam of Death! God, c’mon… Actually, we'll call it\nthe $500,000 Balance Beam. Your 500 grand is dangling\n100 feet in the air. You must balance on this narrow beam, unlock each bag of 50 grand,\nand throw them on the target below. Any money that lands on the target,\nyou move on with, and any money that ends up in the water\nis lost forever. Oh my God. You chicken now?\nYou gonna walk across? The only thing on this platform that's\nchicken are your legs. This is for you, kids. Oh, he's off! The first step. My God, he's doing it.\nHe's actually doing it. Oh my gosh, look at his feet.\nThis is insane! Now he's gotta reach for the money. Oh, he got the money. This is scary 'cause, look,\nhe's actually leaning back. Bro, what's going through your mind?\nYou're like a scarecrow. - Jimmy you're talking too much right now.\n- You're not talking enough! Oh, God. All right.\nAre you gonna throw 'em from here? He landed one! Don’t celebrate too early, Byron.\nYou still have 9 bags to go. He's lining his shot up! Speaking of legs,\nmy leg is cramping right now. Come massage it right now for me! Oh, he threw it! He’s two for two. All right, can he keep his streak alive? Third bag is off. Bullseye! He has $200,000 on his target,\nand Byron isn't even halfway across yet. You feel that wind, Byron? Oh, yeah. The wind\nis really picking up. No, no, no, no, no, no, no, no!\nIt's very unstable. It's actually shaking like crazy! Oh, he almost fell! God! Shoot! Don't pass out on me! Oh, he's just dropping ‘em.\nHe's just dropping ’em! Oh, no. It bounced off. He lost 50K. C’mon, baby! And if you're wondering who\nthis maniac is, his name is Byron, a battle-hardened Army Ranger who's fought\nin the world's most dangerous war zones, and above all else, he wants\nto bring this money home to his kids. Let's go! C’mon, baby. That's it,\nthat's it. That's already $100,000 in the water. And if he falls now,\nhe's losing another $100,000. You gotta land these next two! - Right on the money!\n- Yeah. All right. The last bag! I'm in my head right now. Byron, do it for your kids! Byron, you lost a lot of money\non this round. You've already lost 150 grand,\nand you're only on the third trap. - Jimmy!\n- Yeah? I have a deal for you. You give me 100K back,\nand I'll jump off this. 50 grand and you have a deal. 75! Sure! Just because I wanna see it. You're 100 feet in the air!\nWhat are you talking about? Byron, you're crazy! I've been told that once or twice. Byron, you and your $425,000\nare moving on to trap 4 out of 7. Take off your blindfold! Welcome to the Minefield of Death. Oh my God! Jimmy! Buried beneath this minefield\nare 20 gargantuan bombs completely hidden out of sight. Come on, Jimmy! Your job is to drive your money\nacross the minefield, but be careful which path you take. Because if you\naccidentally trigger a mine, all your money inside of that car\nwill burn to ashes. Roger that. But lucky for you,\nyou have 5 chances to save your money. You can put it all in one car.\nYou could spread ‘em amongst the 5 cars. It's all up to you. So, this is car number 1. - How much money do you want to put in it?\n- None. Predictable. How about car number 2? 25K. You're putting 25 grand in? No, no, no! You can put it all in the last one\nand just pray you don't hit a mine. 25K in this vehicle. - We'll go for it.\n- Yes, let's go! And let’s put everything else\nin the last car. Any sane person would not have chosen to spread their money\noutside of the last car. But as I'm sure you've\nalready picked up on, Byron's not exactly what I'd call normal. So, one of the great benefits\nto this challenge is that most of my experience\nis with roadside bombings. I'm not sitting\nin this vehicle this time. Wait, so you were in a car\nthat drove over a real mine? Yup. The terrorists buried\na roadside bombing too deep. And when it went off,\nit just created a big bump in the road. I didn't know that!\nPlease tell me this doesn't give you PTSD! No, I mean… not really. Lovely. All right, anyways, to the Bunker! Ooh, buddy! And now, the remote control. Of death… It is rigged up to car number 1. Obviously, you hit a mine,\nthe car will blow up. Ok guys, here we go. He's moving! This first car has no money in it.\nIt's technically risk-free. But the more of the map you uncover\nin this car, the better your odds are\nof saving your money in the next car. You could take the right path.\nYou could take the left path. - I'm gonna go left.\n- I'm terrified. There could be an explosion\nat any point. Oh, no! It is not left. One car down, four more to go. But this time, $25,000 is on the line. All right, here we go. I got a hitchhiker! - Karl?\n- What is he doing? Karl’s gonna make sure\nyour car burns extra good this time. I would really avoid\nthis next mine. Thanks, Karl! On this first path, he accidentally\npicked the side that had the mine, which means the right side is clear. Do you regret putting\n25 grand on this one? Yo, 100,000%. He now has another fork in the road. You gonna go left or right? Yeah, I'm gonna stick with the right. So far, so good. I could've just stayed in there. Two cars down and $25,000\nof your money is up in flames. Do we have to talk about it? That amount of money could’ve bought you\na non-exploded car. Karl, he could kill you,\njust so you know. No, I'm very aware.\nI'm very aware. All right, Byron, you haven't even made it\nhalfway through yet. You only have two more failures before you send your remaining $400,000\ndown this road of explosives. At this pace,\nyou'll lose all the money. Oh my goodness. - Send out your third car!\n- Here we go. You got this. You're the bomb. Just stand out there for the rest. Now you can focus better. So right now,\nI am completely unable to see my vehicle. Oh, it's killing me that I don't know\nwhere the mines are. - Any second now it could blow up.\n- God, I don't wanna look. You're coming up on the next 50/50.\nBig decision. You're going right? Yup. - My heart.\n- Oh my God. I'm so nervous. Don't forget, the more mines you trigger\nwith your empty cars, the safer that $400,000 becomes\non your final drive. So far, so good… - What are you thinking?\n- I'm gonna go left. What made you pick left? Uh, it's just a harder route. If it's hard,\nI'm doing it. That's what she said also. - Karl, this is a serious moment.\n- Sorry. This is intense. Over halfway. No bomb yet, but there could be several\nbetween this car and the finish line. I'm gonna stay committed. Oh, he doesn't care. - You're just ripping!\n- He doesn't care! So you now have a winning path. The question is, can you remember it? No, but we're gonna go. So, using his last empty car, Byron made\nsure he had the route memorized. - You're good!\n- Remember the route. Because for the final car, all $400,000\nof his money was now on the line. Now that you know the path, I say\nwe do something special for the final car. I don't trust you anymore! This time, we're gonna walk\nbehind the car. Let's do it. Onward! So if you accidentally trigger a mine, now we'll get a front row view\nto his money blowing up. - You sure this is the path you took?\n- Yes. We're literally\nin between two mines right now. That guy right there is our safety expert,\nand he keeps telling us to back up. So Byron, can you back up? Why have a safety exp— - Karl!\n- Jimmy! - Stay on the side.\n- What're you doing? We're walking through a minefield!\nI'm the wrong one? Keep driving! Wait, I don't know\nif I remember the path. I actually don't remember\nif this is right. Is it right or is it left? Wait, wait. Stop! Wait!\nHe's going so quick. You're one mine away\nfrom ending this entire video. Uh, God! Stop! Stop! Congrats! Your money survived! Good job! It's on my neck! Yeah, ok here.\nI got you. Don't— Don’t die. Don't die. - Wait, wait! The car, the car!\n- Oh, the car! We'll stop it! Could you imagine\nif that triggered a mine and blew up? - Oh, it's coming back!\n- Wait. It doesn't have brakes! Jimmy said, \"It doesn't have brakes,\"\nand got behind it! Well, yeah.\nI had to brake it. All right. Anyways, duck behind the car.\nDuck behind the car. Why are we ducking? - All the mines you didn't blow up\n- Oh, God. we're gonna blow up now. Let's go to the next death trap. We just walked there! Byron's a little harder to kill\nthan I thought. But seriously, he'll be terrified\nwhen he sees the twist on this next trap. Byron, take your blindfold off! For this next trap,\nyou're gonna be buried alive. Oh my God. You're gonna lay in that coffin. Then I'm gonna seal it, cover you with a\nton of dirt, and reveal the challenge. Do you trust me? No. Whenever you're ready,\nclimb in the coffin. There's a hatchet there,\nwhich you'll need. You won't be needing this ladder anymore. Watch out, Karl. Seal the coffin! I'm sorry, Byron. I can't believe I'm doing this, but I'm actually helping you\nseal me in a coffin. Permission to bury you alive? You have my permission to bury me alive. Get to shoveling, boys! Oh my God! Oh Byron, I'm so sorry. No, you're not! While we're burying you,\ncheck underneath your pillow. You'll have the greatest chocolate\nin the world, Feastables. And the greatest meat snack\non the planet, Jack Link's. Yep, yep, I've got 'em. - You have big muscles, right?\n- One might say. And big muscles require protein,\nwouldn't you say? I would. Which is why the Duos I gave you\nis pretty convenient, because it's protein-packed\nand made with 100% real beef. Quite honestly, probably\nin the most uncomfortable position I've ever been in my life. And at least I'm gonna have strong muscles\nfrom my Duos. Oh, God! He's done. You are officially buried alive!\nHow does it feel? I've been better. As you can see,\nthere is a giant flaming furnace with a conveyor belt leading towards it. Pull the lever. Oh! There it goes. This is not your money.\nThis is test money. In a moment, this conveyor belt will start\nslowly dropping your money into this fiery furnace. Behind your knee, you're gonna see an axe. You're gonna to use that axe\nto break your coffin, somehow traverse through all this mulch, and turn that lever off. Which will then stop the conveyor belt,\nAKA, stopping your money from burning. - Now, Karl, turn it off.\n- Ok. Put his money\non the conveyor belt. I'll die before I quit. It's on you.\nGive me a countdown! 3, 2, 1. Pull the lever! All right! Your money is officially\nfalling into the furnace! Good luck. Do you not feel bad burning his money? Of course I do. I feel like your actions\ncontradict your words. He needs to break\nthrough the lid of his coffin. I need to get out of here!\nBro, it's getting everywhere. And while he's digging out of the hole, I wanna tell you about\nJack Link's new product, Duos, because it's actually\ntwo separate flavors in the same bag. This bag, for example, has their\noriginal flavor and their teriyaki. Boys, give it a try. I really enjoy the original and teriyaki. You wanna switch it up?\nGo for the mango and jalepeno. Scan the QR code or click the link\nin the description to buy now. Look at all his money\njust coming up and it— Oh! Whoa. I just caught a dollar!\nThat was crazy! Some of you are gonna think that's fake,\nbut I don't even know how I'd fake that. Byron, your money's burning! This money is making his fire bigger. Keep going, Byron!\nGet outta there! Over $10,000 of your money is burned! - Oh my gosh!\n- C'mon! Oh, he's getting out! You got it! Oh, my gosh!\nDon't cut yourself! Yes! - You're a monster!\n- You came out like a zombie! He swallowed dirt! Before we go\nto the next death trap, you let me know what you think of\nJack Link's Duo, their brand new product? These are legit phenomenal. Byron, I hope that jerky\ngave you a lot of protein, because you're gonna need it\nfor this sixth trap. Welcome to the next trap. I'm a little bit nervous on this one. Behind you is your $384,000. Don't move. To the trap! Oh my God. What do you think the trap is? I'm going up somewhere. In order to pass this trap, you must scale up this 60 foot tower\nwhile hanging this money behind you. And this trap is different than the last. It is all or nothing here. If you fall one time or drop a single bag,\njust like in other videos like this, you will lose everything\nand the video will end. But there is a twist. You don't have to carry all of it. To make yourself lighter,\nyou can leave some of the money behind. And all of this money\nliterally weighs 200 pounds. So it's up to you to decide\nhow much money to carry to the top. So one of the things\nI'm thinking about right now is leaving it as high up\non this as possible. So if he leaves them\non that platform, that's basically 3 or 4 feet less that\nhe's gonna have to be pulling the bags. If he somehow cheats this trap,\nI'm never casting an Army Ranger again. If you ain't cheating, you ain't trying. I can tell. I'm gonna be honest,\nI don't think you can carry it to the top. Let's push this body\nand see what it can do. You're crazy, man. I’m gonna go up top.\nNo shot he’s making it. A lot of people in my life didn't, uh, believe that I could do and accomplish\nthe things that I've accomplished, so my goal is to prove that I can. It's about that time\nwhere you have to decide: How much money\nare you going to attempt to drag up here? It's all or nothing,\nbrother. You are a psychopath. If just one extra bag is too heavy\nfor you, you'll risk losing all of it. You don't even want to just leave\n50,000 behind? Nope. I'm going. All right, he's officially off. If he falls, the video ends.\nHe gets no money whatsoever. And as soon as all these bags\nare suspended in the air, the full weight will be on his back. That's way heavier\nthan I was thinking. Look at this trail of bags behind him! He is literally climbing up a 90 degree\nincline carrying 200 pounds of money! What's going through your mind? Ah, you brought the heat\non this one, Jimmy! He's going fast. Oh my God, he's falling. He is just brute-forcing it! Oh, God. All right,\nthe hardest part is coming up! Oh my God, almost there. Yeah, he has 200 pounds of money! I can't give up! Oh, gosh!\nLet me get out of his way! Bro! This is insanely impressive. You have no idea\nhow heavy this is! Oh, you did it! You did it! Yeah! People don't realize how heavy money is. And when you have over 300,000 bills,\nit adds up. You only have one death trap left between\nyou and me wiring you all this money. Oh, God. Jimmy. Let's do this. All right! To the junkyard! …where lies Byron's final obstacle\nbetween him and his money. Are you ready? As ready as I'll ever be.\nLet's do this. Why are you flexing? When I'm uncomfortable,\nI just start randomly flexing. Ok! Take off your blindfold.\nWelcome to the final trap. - You must protect your money right here\n- Ok? from that bomb. Oh my God. I'm giving you three construction workers, Holy crap. - a ton of machinery,\n- Ok. and you can use anything\nin this junkyard to protect it. In 8 hours,\nthat bomb will drop. - Gotta go.\n- Good luck! In past videos,\neven when given 24 hours, contestants have failed\nto protect their money. If Byron succeeds in a third of the time,\nit will be a first in Beast history. So now we got to figure out\nwhat's flammable, what's not flammable. This roof is plastic,\nso that's gonna burn. We don't want that. You have a ton of hoods over here. - Do you think these will burn?\n- No. So this could be, like,\nyour blast shield at the top. Yeah. All right, guys. I want to get as many of these hoods\nover here as possible. If it burns, like, there's,\nlike, that felt on it? Rip— just rip that felt off. No fiberglass, no nothing.\nIt has to be metal and metal only. - Do you think this would be of any use?\n- Not at all. But you can get rid of the plastic jugs\nand use the metal. Uh, yep. Ok. So what you're seeing me do right now\nis grabbing my cages that are going to end up\nbecoming my buffer. Now the flammable plastic is gone, he has this nice metal frame\nto put around the money. That's smart. - Do you think these would be of any use?\n- Not at all. Considering what the bomb\nis potentially made out of and there's a liquid accelerant inside,\nit's gonna burn fast, and this astroturf right here\nis flammable. But it looks good on camera, though. I don't care. Ok. I figured he'd say that. They've gotta make sure they remove\neverything flammable, because the bomb might increase\nthe temperature in there so much that it could light on fire. So now, we're gonna take this,\nand we're gonna— Oh, you’re gonna make, like,\na shield with hoods. Yep, so bring in our containers. Then we're gonna start stacking them\nas high as I can get them - Ok.\n- creating a multi-story tomb of metal until, basically,\nI'm told I can't build this any higher. You can build as high as you want. Ok, well, it's gonna keep going. Ok. Good luck! And as confident as he felt\nabout his plan, Byron thought there was still a piece\nmissing from his puzzle. We’re gonna create another layer of these\nover the top of it, but I wanna get that money\nas secured as possible. And I know I said the less I have\non there that's flammable, the better, but if it's insulated,\nit may not affect the money at all. In Indiana Jones,\nthis literally survived a nuke. Yeah well, they don't make things\nthat way anymore. - So…\n- Oh, really? You don't think this would survive? I mean… you know, it could. Well, I guess Byron gave\nmy Indiana Jones joke some thought, because it looks like\nhe just found the Holy Grail in money-incinerating defense. Oh, what is this?\nWhat did we just find? Let's flip this. 1, 2, 3, flip! Oh, yeah. Oh, yeah. Yes! So much “yes” right here. We're gonna close the money\ninside of this, then bury it\nat the bottom of my barricade. Now that Byron had everything he needed,\nit was full steam ahead. Got it? So, yeah, we’re gonna start\nlaying those across, over the top. And I need cinder blocks stacked\nin this dead space. All right here. The mentality that I have with things\nis success or death, in everything. I don't give myself a plan B. You cannot have bravery\nand courage… without fear. I'm not gonna, lie Byron's defense\nstrategy was looking pretty airtight. That was, until he decided to place a massive fiberglass boat\non top of his structure. That's a highly flammable object right next to the massive bomb\nwe're about to drop. Isn't the boat fiberglass? Oh, man… No fiberglass, no nothing.\nIt has to be metal and metal only. I'm genuinely at a loss right now. Time is up! - You all right?\n- Yeah, yeah. Dead serious, like, just I'm seriously\njust second-guessing everything right now. How you doing, buddy? Oh my gosh, Jimmy. Dude, you've literally buried me alive. You made me climb with over 200 pounds— Don't forget when we\ndrove through a minefield. Made me drive through a minefield. And I put you\nin a room with a bear. A thousand pound bear.\nNot just any bear. A huge bear. Absolutely everything comes down to this\nlast moment right here in front of me. Literally everything. The only thing that really matters\nis always being a hero to my wife and kids but the influential mind,\nseeing that fear is ok, it's what you do\nin the midst of that fear. You can't have courage without… without being scared. $384,000 on the line\nwith your wife and kids here to watch, and it all comes down\nto this explosion. Oh, man. - Are you nervous?\n- Yes. I'm extremely nervous. Ok. Any last words? Let's do it. 3, 2, 1! Drop the bomb! Everything's on fire! Let's go! There’s so much fire! Byron, a bomb just went off!\nBe careful. No! Oh, whoa.\nThat is burning. Go, Byron, go! It’s under the boat,\nit’s under the boat, it’s under the boat! Oh, there’s still more! That is the fridge\nhe put his money inside of. All right, slowly bring her down! Moment of truth. It worked! Yes! - Yes!\n- The money didn’t burn!! The money’s safe! Let's go! Yes! Yes! Oh my God! Congratulations! $384,000! 384 grand! We did it! This is gonna change\nso much for us, Jimmy. I’m gonna buy a tractor\nfor the ranch. - Subscribe to MrBeast!\n- Subscribe! I agree.",
  "language": "en",
  "is_generated": false,
  "extractedAt": "2025-06-20T09:43:24.004Z"
}